{"modelTopology":{"class_name":"Model","config":{"name":"hiring_model","layers":[{"name":"user_skills_input","class_name":"InputLayer","config":{"batch_input_shape":[null,20],"dtype":"float32","sparse":false,"name":"user_skills_input"},"inbound_nodes":[]},{"name":"job_skills_input","class_name":"InputLayer","config":{"batch_input_shape":[null,20],"dtype":"float32","sparse":false,"name":"job_skills_input"},"inbound_nodes":[]},{"name":"skill_embedding","class_name":"Embedding","config":{"input_dim":20,"output_dim":16,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":true,"input_length":null,"name":"skill_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["user_skills_input",0,0,{}]],[["job_skills_input",0,0,{}]]]},{"name":"global_average_pooling1d_GlobalAveragePooling1D1","class_name":"GlobalAveragePooling1D","config":{"name":"global_average_pooling1d_GlobalAveragePooling1D1","trainable":true},"inbound_nodes":[[["skill_embedding",0,0,{}]]]},{"name":"global_average_pooling1d_GlobalAveragePooling1D2","class_name":"GlobalAveragePooling1D","config":{"name":"global_average_pooling1d_GlobalAveragePooling1D2","trainable":true},"inbound_nodes":[[["skill_embedding",1,0,{}]]]},{"name":"numeric_input","class_name":"InputLayer","config":{"batch_input_shape":[null,7],"dtype":"float32","sparse":false,"name":"numeric_input"},"inbound_nodes":[]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["global_average_pooling1d_GlobalAveragePooling1D1",0,0,{}],["global_average_pooling1d_GlobalAveragePooling1D2",0,0,{}],["numeric_input",0,0,{}]]]},{"name":"feature_projection_layer","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"feature_projection_layer","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["feature_projection_layer",0,0,{}]]]},{"name":"hiring_probability","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"hiring_probability","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]}],"input_layers":[["user_skills_input",0,0],["job_skills_input",0,0],["numeric_input",0,0]],"output_layers":[["hiring_probability",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"skill_embedding/embeddings","shape":[20,16],"dtype":"float32"},{"name":"feature_projection_layer/kernel","shape":[39,32],"dtype":"float32"},{"name":"feature_projection_layer/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[32,16],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[16],"dtype":"float32"},{"name":"hiring_probability/kernel","shape":[16,1],"dtype":"float32"},{"name":"hiring_probability/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}